In [21]:
import pandas as pd 

df=pd.read_excel(r"D:\test1\Students.xlsx")
df.head(5)

    姓名  Age  Chinese   Math  English
0   王璐   16     99.0  106.5       55
1  韦玉英   26     96.0  104.0       68
2   赖雷   33     85.0  109.5       96
3   邵宁   27     99.5  105.0      100
4   杨龙   32     85.0  105.5       63

In [22]:
df.shape

(20, 5)

In [23]:
df['one']=1
df.head(3)

    姓名  Age  Chinese   Math  English  one
0   王璐   16     99.0  106.5       55    1
1  韦玉英   26     96.0  104.0       68    1
2   赖雷   33     85.0  109.5       96    1

In [24]:
df_merge=pd.merge(left=df,right=df,left_on='one',right_on='one')
df_merge.head(3)

,姓名_x,Age_x,Chinese_x,Math_x,English_x,one,姓名_y,Age_y,Chinese_y,Math_y,English_y
0,王璐,16,99.0,106.5,55,1,王璐,16,99.0,106.5,55
1,王璐,16,99.0,106.5,55,1,韦玉英,26,96.0,104.0,68
2,王璐,16,99.0,106.5,55,1,赖雷,33,85.0,109.5,96

In [6]:
df_merge.shape

(400, 11)

In [25]:
columns = list(df.columns)
columns.remove("姓名")
columns.remove("one")
columns

['Age', 'Chinese', 'Math', 'English']

In [26]:

def sim_fun(row):
    sim_value = 0.0
    for column in columns:
        sim_value += abs(int(row[column+"_x"]) - int(row[column+"_y"]))
    return sim_value

In [27]:

df_merge["sim"] = df_merge.apply(sim_fun, axis=1)

In [28]:
df_merge.head(3)

,姓名_x,Age_x,Chinese_x,Math_x,English_x,one,姓名_y,Age_y,Chinese_y,Math_y,English_y,sim
0,王璐,16,99.0,106.5,55,1,王璐,16,99.0,106.5,55,0.0
1,王璐,16,99.0,106.5,55,1,韦玉英,26,96.0,104.0,68,28.0
2,王璐,16,99.0,106.5,55,1,赖雷,33,85.0,109.5,96,75.0

In [29]:
df_merge = df_merge[df_merge["姓名_x"] != df_merge["姓名_y"]].copy()

In [30]:
df_merge.head(3)

,姓名_x,Age_x,Chinese_x,Math_x,English_x,one,姓名_y,Age_y,Chinese_y,Math_y,English_y,sim
1,王璐,16,99.0,106.5,55,1,韦玉英,26,96.0,104.0,68,28.0
2,王璐,16,99.0,106.5,55,1,赖雷,33,85.0,109.5,96,75.0
3,王璐,16,99.0,106.5,55,1,邵宁,27,99.5,105.0,100,57.0

In [31]:
def get_top_student(df_sub):
    df_sort = df_sub.sort_values(by="sim", ascending=False).head(10)
    names = ",".join(list(df_sort["姓名_y"]))
    sims = ",".join([str(x) for x in list(df_sort["sim"])])
    return pd.Series({"names": names, "sims": sims})

In [32]:
df_result = df_merge.groupby("姓名_x").apply(get_top_student)

In [34]:
df_result.to_excel("./相似计算结果.xlsx", index=True)